#ifndef _RECGEOMETRY_H_
#define _RECGEOMETRY_H_


#include <iostream>
#include <vector>
#include <list>
#include <math.h>

using namespace std;

#ifndef PI
#define PI 3.14159265358979323846
#endif


/*****************************************************************************
 * HEADER CLASSES (included in this file)
 *****************************************************************************/
class RecRadians;             //1
class RecPoint2D;             //2
class RecPoint3D;             //3
class RecVector2D;            //4
class RecVector3D;            //5
class RecPose2D;              //6
class RecDifferentialPose2D;  //7
class RecPose3D;              //8
class RecDifferentialPose3D;  //9
class RecTransform2D;         //10
class RecTransform3D;         //11
class RecQuaternion;          //12
class RecLineSegment2D;       //13
class RecLineSegment3D;       //14
class RecBox2D;               //15
class RecAxisAlignedBox2D;    //16
class RecBox3D;               //17
class RecAxisAlignedBox3D;    //18
class RecPolygon2D;           //19
//class RecPolygon3D;         //*20



//*****************************************************************************
/*!
* \brief A radians class that enforces -PI < value <= PI
*
* A RecRadians object is designed to look as much like a double value as
* possible.  The object allows for direct casting to/from a double value
* and supports all of the arithmetic operators.  The object always inforces
* the the radian value is scaled between -PI and PI.  This combined with the
* support for automatic casting to doubles allows for a RecRadian to be passed
* as an argument to any math.h trig function that takes a radian argument.
* @ingroup recGeometryGroup
*/
//*****************************************************************************
class RecRadians
{
public:
    // Static Member
	static const double tolerance; //!< tolerance for which two RecRadians objects are considered equal

    // Constructor
